InformationRegisters/ЦеныПараметровПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПараметровПродукции</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрПродукции</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПараметровПродукцииИндивидуальные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПараметровПродукцииИндивидуальные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦены</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрПродукции</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВидыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыЦен</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ПорядокОкругленияСтоимостиПроизводимыхПотолков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОкруглятьВБольшуюСторонуСтоимостьПроизводимыхПотолков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылочныйВидЦены</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНоменклатуры</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНаПродукцию</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНаУслугиПроизводства</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценкиОтБП1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЦеныПараметровПродукции/Ext/ManagerModule.bsl
Функция ПолучитьЦену(Номенклатура, ДатаЦены, ВидЦены, ВалютаДокумента,
	                          Знач Контрагент = Неопределено, Знач ДоговорКонтрагента = Неопределено) Экспорт
	
	Результат = 0;
	ЦенаНоменклатуры = ПолучитьЦенуВВалюте(Номенклатура, КонецДня(ДатаЦены), ВидЦены, ВалютаДокумента, Контрагент, ДоговорКонтрагента);
	
	Если НЕ ЦенаНоменклатуры = 0 Тогда
		Возврат ЦенаНоменклатуры;
	КонецЕсли;
		
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	ОсновнаяВалютаПересчетаЦены = Константы.ОсновнаяВалютаПересчетаЦены.Получить();
	
	// 1. Если не нашли цену по валюте документа и задана валюта пересчета, ищем прайс в валюте пересчета
	//	(если нашли, то ставим цену в валюте документа по курсу к валюте пересчета)
	Если ЗначениеЗаполнено(ОсновнаяВалютаПересчетаЦены) Тогда
		
		ЦенаНоменклатуры = ПолучитьЦенуВВалюте(Номенклатура, КонецДня(ДатаЦены), ВидЦены, ОсновнаяВалютаПересчетаЦены, Контрагент, ДоговорКонтрагента);
		
		Если НЕ ЦенаНоменклатуры = 0 Тогда
			
			ДатаКурса = ДатаЦены;
			
			Если ДатаКурса = Дата(1,1,1) Тогда
				ДатаКурса = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Возврат РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ОсновнаяВалютаПересчетаЦены, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// 2. Если не нашли цену по валюте пересчета, то ищем прайс в валюте учета (если валюта документа отличается от валюты учёта)
	//	(если нашли, то ставим цену в валюте документа по курсу к валюте учета)
	Если НЕ ВалютаДокумента = ВалютаУчета Тогда
		
		ЦенаНоменклатуры = ПолучитьЦенуВВалюте(Номенклатура, КонецДня(ДатаЦены), ВидЦены, ВалютаУчета, Контрагент, ДоговорКонтрагента);
		
		Если НЕ ЦенаНоменклатуры = 0 Тогда
			
			ДатаКурса = ДатаЦены;
			
			Если ДатаКурса = Дата(1,1,1) Тогда
				ДатаКурса = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Возврат РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаУчета, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат ЦенаНоменклатуры;
	
КонецФункции

Функция ПолучитьЦенуВВалюте(Знач Номенклатура, Знач ДатаЦены, Знач ВидЦены, Знач Валюта,
							Знач Контрагент = Неопределено, Знач ДоговорКонтрагента = Неопределено) Экспорт
		
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ДанныеСправочника.Значение) = ТИП(ЧИСЛО)
	|				ТОГДА (ВЫРАЗИТЬ(ДанныеСправочника.Значение КАК ЧИСЛО)) * ЕСТЬNULL(ЦеныСрез.Цена, 0)
	|			ИНАЧЕ ЕСТЬNULL(ЦеныСрез.Цена, 0)
	|		КОНЕЦ) КАК Цена
	|ИЗ
	|	Справочник.Номенклатура.ПараметрыПродукции КАК ДанныеСправочника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПараметровПродукции.СрезПоследних(
	|				&ДатаЦены,
	|				ВЫБОР
	|						КОГДА ВЫРАЗИТЬ(&ВидЦены КАК Справочник.ВидыЦен).СсылочныйВидЦены = ИСТИНА
	|							ТОГДА ВидЦены = ВЫРАЗИТЬ(&ВидЦены КАК Справочник.ВидыЦен).ВидЦеныНаПродукцию
	|						ИНАЧЕ ВидЦены = &ВидЦены
	|					КОНЕЦ
	|					И Валюта = &Валюта) КАК ЦеныСрез
	|		ПО (ЦеныСрез.ПараметрПродукции = ДанныеСправочника.ПараметрПродукции)
	|			И (ЦеныСрез.ВидПродукции = ДанныеСправочника.Ссылка.ВидПродукции)
	|ГДЕ
	|	ДанныеСправочника.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("ДатаЦены",			КонецДня(ДатаЦены));
	Запрос.УстановитьПараметр("ВидЦены",			ВидЦены);
	Запрос.УстановитьПараметр("Номенклатура",		Номенклатура);
	Запрос.УстановитьПараметр("Валюта",				Валюта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Цена;
	КонецЕсли;
	
	// индивидуальные цен
	Если НЕ Контрагент = Неопределено ИЛИ ДоговорКонтрагента = Неопределено Тогда
		Если Контрагент = Неопределено Тогда
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		Если ДоговорКонтрагента = Неопределено Тогда
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		Результат = ПолучитьИндивидуальнуюЦену(Результат, Номенклатура, ДатаЦены, Валюта, Контрагент, ДоговорКонтрагента);
	КонецЕсли;
													
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИндивидуальнуюЦену(ТекущаяЦена, Номенклатура, ДатаЦены, Валюта,
									Знач Контрагент, Знач ДоговорКонтрагента)
									
	Результат = ТекущаяЦена;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеЦены") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ЦеныИндивидуальныеСрезПоследних.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|				ТОГДА ВЫБОР
		|						КОГДА ТИПЗНАЧЕНИЯ(ДанныеСправочника.Значение) = ТИП(ЧИСЛО)
		|							ТОГДА (ВЫРАЗИТЬ(ДанныеСправочника.Значение КАК ЧИСЛО)) * ЕСТЬNULL(ЦеныИндивидуальныеСрезПоследних.Цена, 0)
		|						ИНАЧЕ ЕСТЬNULL(ЦеныИндивидуальныеСрезПоследних.Цена, 0)
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(ДанныеСправочника.Значение) = ТИП(ЧИСЛО)
		|						ТОГДА ВЫРАЗИТЬ((ВЫРАЗИТЬ(ДанныеСправочника.Значение КАК ЧИСЛО)) * ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ЦеныИндивидуальныеСрезПоследних.Наценка) / 100 КАК ЧИСЛО(15, 2))
		|					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) * (100 + ЦеныИндивидуальныеСрезПоследних.Наценка) / 100 КАК ЧИСЛО(15, 2))
		|				КОНЕЦ
		|		КОНЕЦ) КАК Цена,
		|	МАКСИМУМ(ЕСТЬNULL(ЦеныИндивидуальныеСрезПоследних.Отменена, ЛОЖЬ)) КАК Отменена
		|ИЗ
		|	Справочник.Номенклатура.ПараметрыПродукции КАК ДанныеСправочника
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПараметровПродукцииИндивидуальные.СрезПоследних(
		|				&ДатаЦены,
		|				Контрагент = &Контрагент
		|					И ДоговорКонтрагента = &ДоговорКонтрагента
		|					И Валюта = &Валюта) КАК ЦеныИндивидуальныеСрезПоследних
		|		ПО (ЦеныИндивидуальныеСрезПоследних.ВидПродукции = ДанныеСправочника.Ссылка.ВидПродукции)
		|			И (ЦеныИндивидуальныеСрезПоследних.ПараметрПродукции = ДанныеСправочника.ПараметрПродукции)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПараметровПродукции.СрезПоследних(&ДатаЦены, Валюта = &Валюта) КАК ЦеныСрезПоследних
		|		ПО (ЦеныИндивидуальныеСрезПоследних.ВидПродукции = ЦеныСрезПоследних.ВидПродукции)
		|			И (ЦеныИндивидуальныеСрезПоследних.ПараметрПродукции = ЦеныСрезПоследних.ПараметрПродукции)
		|			И (ЦеныИндивидуальныеСрезПоследних.ВидЦены = ЦеныСрезПоследних.ВидЦены)
		|ГДЕ
		|	ДанныеСправочника.Ссылка = &Номенклатура";
		
		Запрос.УстановитьПараметр("ДатаЦены",			КонецДня(ДатаЦены));
		Запрос.УстановитьПараметр("Контрагент",			Контрагент);
		Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
		Запрос.УстановитьПараметр("Номенклатура",		Номенклатура);
		Запрос.УстановитьПараметр("Валюта",				Валюта);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если НЕ Выборка.Цена = Null 
				И НЕ Выборка.Отменена Тогда
				Результат = Выборка.Цена;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
